source/.NET Standard/Unimake.Business.DFe/Servicos/Config/NFSe/MairipotabaGO.xml

<?xml version="1.0" encoding="utf-8"?>
<Configuracoes>
	<Servicos ID="NFSe">
		<GerarNfse versao="2.02">
			<Descricao>Gerar Nota Fiscal de Serviço</Descricao>
			<WebEnderecoHomologacao></WebEnderecoHomologacao>
			<WebEnderecoProducao>https://mairipotaba.megasoftarrecadanet.com.br/ws/nfseSOAP</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>nfse_v01.xsd</SchemaArquivo>
			<TagAssinatura>Rps</TagAssinatura>
			<TagAtributoID>InfDeclaracaoPrestacaoServico</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=utf-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><GerarNfseRequest xmlns="http://ws.megasoftarrecadanet.com.br"><nfseCabecMsg xmlns="">&lt;cabecalho versao="1.00" xmlns="http://megasoftarrecadanet.com.br/xsd/nfse_v01.xsd"&gt;&lt;versaoDados&gt;1.00&lt;/versaoDados&gt;&lt;/cabecalho&gt;</nfseCabecMsg><nfseDadosMsg xmlns="">{xmlBodyScape}</nfseDadosMsg></GerarNfseRequest></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns3:GerarNfseResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.02</SchemaVersao>
			<TargetNS>http://megasoftarrecadanet.com.br/xsd/nfse_v01.xsd</TargetNS>
		</GerarNfse>
		<ConsultarNfsePorRps versao="2.02">
			<Descricao>Consulta NFSe por RPS</Descricao>
			<WebEnderecoHomologacao></WebEnderecoHomologacao>
			<WebEnderecoProducao>https://mairipotaba.megasoftarrecadanet.com.br/ws/nfseSOAP</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>nfse_v01.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=utf-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarNfsePorRpsRequest xmlns="http://ws.megasoftarrecadanet.com.br"><nfseCabecMsg xmlns="">&lt;cabecalho versao="1.00" xmlns="http://megasoftarrecadanet.com.br/xsd/nfse_v01.xsd"&gt;&lt;versaoDados&gt;1.00&lt;/versaoDados&gt;&lt;/cabecalho&gt;</nfseCabecMsg><nfseDadosMsg xmlns="">{xmlBodyScape}</nfseDadosMsg></ConsultarNfsePorRpsRequest></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns3:ConsultarNfsePorRpsResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.02</SchemaVersao>
			<TargetNS>http://megasoftarrecadanet.com.br/xsd/nfse_v01.xsd</TargetNS>
		</ConsultarNfsePorRps>
	</Servicos>
</Configuracoes>